#+TITLE: Plan for Run cluster automation with setup-ovpl on local machine.
#+AUTHOR: VLEAD
#+DATE: [2017-09-12 Tue]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document contains the realization plan for run cluster
    automation with setup-ovpl on local machine.

* Plan 
** [[https://gitlab.com/vlead-systems/cluster-automation/milestones/5][Milestone-setup OpenVZ cluster automation on local machine]]
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone-one
  :END: 

#+caption:  realization-plan
#+name: tbl-realization-plan
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|    S. | Tasks                                            | Github | Expected | Actual |  Estimated |     Actual | Status     | Assignee   |
|    NO |                                                  | Issues |   Effort | Effort |     Start/ |     Start, |            |            |
|       |                                                  |        |      (in |    (in |        End |        End |            |            |
|       |                                                  |        |   person | person |      Dates |      Dates |            |            |
|       |                                                  |        |   hours) | hours) |            |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|    1. | Install centos-6.9 os                            | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        8 |      5 | 09-09-2017 | 11-09-2017 | Done       | Raghupathi |
|       | and required packages                            |        |          |        | 11-09-2017 | 11-09-2017 |            |            |
|       | for cluster automation                           |        |          |        |            |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|    2. | Prepare ansible script to                        | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        4 |      3 | 12-09-2017 | 12-09-2017 | Done       | Raghupathi |
|       | install OpenVZ without                           |        |          |        | 13-09-2017 | 13-09-2017 |            |            |
|       | install dependecies and mongodb                  |        |          |        |            |            |            |            |
|       | using setup-centos repo                          |        |          |        |            |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|    3. | Prepare ansible script to                        | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        4 |      3 | 12-09-2017 | 12-09-2017 | Done       | Raghupathi |
|       | install dependencies without                     |        |          |        | 13-09-2017 | 13-09-2017 |            |            |
|       | OpenVZ using setup-centos repo                   |        |          |        |            |            |            |            |
|       | on Base4 container                               |        |          |        |            |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|    4. | Prepare ansible script to                        | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        8 |      4 | 13-09-2017 | 13-09-2017 | Done       | Raghupathi |
|       | install tornado-4.3 on Base4 container           |        |          |        | 14-09-2017 |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|    5. | Update ansible scripts                           | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |       24 |     10 | 13-09-2017 | 24-09-2017 | Done       | Raghupathi |
|       | to run playbooks on hostmache                    |        |          |        | 22-09-2017 |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|    6. | Adding base-machine-setup.yml,                   | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        5 |      3 | 24-09-2017 | 25-09-2017 | Done       | Raghupathi |
|       | ads.yml and tornado.yml files into               |        |          |        | 25-09-2017 |            |            |            |
|       | cluster automation machine implementation        |        |          |        |            |            |            |            |
|       | yml files                                        |        |          |        |            |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|    7. | Run bootstrap.sh script on local machine         | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        4 |      3 | 25-09-2017 | 25-09-2017 | Done       | Raghupathi |
|       |                                                  |        |          |        | 25-09-2017 |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|    8. | Deploy a lab on local machine using ADS service. | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        3 |      8 | 25-09-2017 |            |            |            |
|       |                                                  |        |          |        | 02-10-2017 | 02-10-2017 | Done       | Raghupathi |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|    9. | Install Openvz on                                |        |        2 |        | 26-10-2017 | 26-10-2017 | In process | Raghupathi |
|       | host machine using                               |        |          |        | 26-10-2017 | 26-10-2017 |            |            |
|       | shell script                                     |        |          |        |            |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|   10. | Install dependecies                              |        |          |        |            |            |            |            |
|       | on ADS container                                 |        |          |        |            |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
|   11. | Configure ADS using                              |        |          |        |            |            |            |            |
|       | ansible scripts                                  |        |          |        |            |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
| Total |                                                  |        |       62 |        |            |            |            |            |
|     ^ |                                                  |        |    total |        |            |            |            |            |
|-------+--------------------------------------------------+--------+----------+--------+------------+------------+------------+------------|
#+TBLFM: $total=vsum(@II+1..@-1)



